'''
Вам дан список голосов за кандидатов на выборы.

Кандидат побеждает в выборах, если он собрал больше половины всех голосов. Если такого кандидата нет, то в следующий тур выходят два участника с максимальными количествами голосов.

Ваша задача написать функцию, принивающую список голосов и возвращающая победителя либо победителей этого тура.

Пример
selection(
    [
        "Полуэкт Варфоломеев",
        "Варфоломей Полуэктов",
        "Полуэкт Варфоломеев",
    ]
) #=> "Полуэкт Варфоломеев"
selection(
    [
        "Полуэкт Варфоломеев",
        "Варфоломей Виссарионов",
        "Виссарион Полуэктов",
        "Варфоломей Виссарионов",
        "Варфоломей Виссарионов",
        "Полуэкт Варфоломеев",
    ]
) #=> ("Варфоломей Виссарионов", "Полуэкт Варфоломеев")
'''

class MyClass():

    def myfunc(self, ):
        '''
        Here we write all the logic and return result

        :return:
        '''
        result = None

        return result # here we retrun result

if __name__ == '__main__':
   # Here we can make console input and check how function works

   # var = input('Input VAR: ')

   result = MyClass().myfunc()

   print(result)
