'''
Проверить номер карты
Ваша задача написать программу, принимающее 16-значное число - номер кредитной карты. И проверяющей может ли такая
картa существовать.

Примечания
Алгоритм Луна: https://ru.wikipedia.org/wiki/%D0%90%D0%BB%D0%B3%D0%BE%D1%80%D0%B8%D1%82%D0%BC_%D0%9B%D1%83%D0%BD%D0%B0
'''

class MyClass():

    def myfunc(self, ):
        '''
        Here we write all the logic and return result

        :return:
        '''
        result = None

        return result # here we retrun result

if __name__ == '__main__':
   # Here we can make console input and check how function works

   # var = input('Input VAR: ')

   result = MyClass().myfunc()

   print(result)
